Name: Krishna GSVV  
Roll no. AV.EN.U4CSE22016  
Date: 27/8/24

In [6]:
import pandas as pd
import numpy as np

data = {
    'A': [1.0,2.0,np.nan,4.0,5.0],
    'B': [np.nan,2.0,3.0,4.0,5.0],
    'C': [1.0,np.nan,3.0,4.0,np.nan]
}

df = pd.DataFrame(data)
print(df)

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  NaN
2  NaN  3.0  3.0
3  4.0  4.0  4.0
4  5.0  5.0  NaN

In [8]:
df.isnull()

       A      B      C
0  False   True  False
1  False  False   True
2   True  False  False
3  False  False  False
4  False  False   True

In [10]:
df.notnull()

       A      B      C
0   True  False   True
1   True   True  False
2  False   True   True
3   True   True   True
4   True   True  False

In [14]:
df.isnull().sum()

A    1
B    1
C    2
dtype: int64

In [15]:
df.dropna()

     A    B    C
3  4.0  4.0  4.0

In [19]:
df.dropna(axis=1)

     B
0  2.0
1  2.0
2  3.0
3  4.0
4  5.0

In [20]:
import pandas as pd
import numpy as np


data = {
    'A': [1.0,2.0,np.nan,4.0,5.0],
    'B': [2.0,2.0,3.0,4.0,5.0],
   

}

df = pd.DataFrame(data)
print(df)

     A    B
0  1.0  2.0
1  2.0  2.0
2  NaN  3.0
3  4.0  4.0
4  5.0  5.0

In [21]:
df.dropna(axis=1)

     B
0  2.0
1  2.0
2  3.0
3  4.0
4  5.0

In [22]:
import pandas as pd
import numpy as np


data = {
    'A': [1.0,2.0,np.nan,4.0,5.0],
    'B': [np.nan,2.0,3.0,4.0,5.0],
    'C': [1.0,np.nan,3.0,4.0,np.nan]

}

df = pd.DataFrame(data)
print(df)

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  NaN
2  NaN  3.0  3.0
3  4.0  4.0  4.0
4  5.0  5.0  NaN

In [24]:
df.fillna(15)

      A     B     C
0   1.0  15.0   1.0
1   2.0   2.0  15.0
2  15.0   3.0   3.0
3   4.0   4.0   4.0
4   5.0   5.0  15.0

In [26]:
i=100
df.fillna(i)

       A      B      C
0    1.0  100.0    1.0
1    2.0    2.0  100.0
2  100.0    3.0    3.0
3    4.0    4.0    4.0
4    5.0    5.0  100.0

In [29]:
df.fillna(df.mean())

     A    B         C
0  1.0  3.5  1.000000
1  2.0  2.0  2.666667
2  3.0  3.0  3.000000
3  4.0  4.0  4.000000
4  5.0  5.0  2.666667

In [30]:
#other way for mean
df.apply(lambda col:col.fillna(col.mean(),axis=0))

     A    B         C
0  1.0  3.5  1.000000
1  2.0  2.0  2.666667
2  3.0  3.0  3.000000
3  4.0  4.0  4.000000
4  5.0  5.0  2.666667

In [31]:
df.fillna(method="ffill")

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  1.0
2  2.0  3.0  3.0
3  4.0  4.0  4.0
4  5.0  5.0  4.0

In [32]:
df.fillna(method="bfill")

     A    B    C
0  1.0  2.0  1.0
1  2.0  2.0  3.0
2  4.0  3.0  3.0
3  4.0  4.0  4.0
4  5.0  5.0  NaN

In [34]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

# Create a DataFrame with NULL values
data = {
    'Column1': [1, 2, np.nan, 4,5],
    'Column2': [np.nan, 2, 3, 4,5],
    'Column3': [1, np.nan, 3, 4,np.nan]
}

df = pd.DataFrame(data)

# Create a SimpleImputer object with the mean strategy
imputer = SimpleImputer(strategy='mean')

# Fit the imputer and transform the DataFrame
df_imputed = pd.DataFrame(imputer.fit_transform(df), columns=df.columns)


print("original DataFrame with missing values:\n",df)
print("\n DataFrame after imputation:\n",df_imputed)

original DataFrame with missing values:
    Column1  Column2  Column3
0      1.0      NaN      1.0
1      2.0      2.0      NaN
2      NaN      3.0      3.0
3      4.0      4.0      4.0
4      5.0      5.0      NaN

 DataFrame after imputation:
    Column1  Column2   Column3
0      1.0      3.5  1.000000
1      2.0      2.0  2.666667
2      3.0      3.0  3.000000
3      4.0      4.0  4.000000
4      5.0      5.0  2.666667

In [35]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

# Create a DataFrame with NULL values
data = {
    'Column1': [1, 2, np.nan, 4,5],
    'Column2': [np.nan, 2, 3, 4,5],
    'Column3': [1, np.nan, 3, 4,np.nan]
}

df = pd.DataFrame(data)

# Create a SimpleImputer object with the mean strategy
imputer = SimpleImputer(strategy='median')

# Fit the imputer and transform the DataFrame
df_imputed = pd.DataFrame(imputer.fit_transform(df), columns=df.columns)


print("original DataFrame with missing values:\n",df)
print("\n DataFrame after imputation:\n",df_imputed)

original DataFrame with missing values:
    Column1  Column2  Column3
0      1.0      NaN      1.0
1      2.0      2.0      NaN
2      NaN      3.0      3.0
3      4.0      4.0      4.0
4      5.0      5.0      NaN

 DataFrame after imputation:
    Column1  Column2  Column3
0      1.0      3.5      1.0
1      2.0      2.0      3.0
2      3.0      3.0      3.0
3      4.0      4.0      4.0
4      5.0      5.0      3.0

In [37]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

# Create a DataFrame with NULL values
data = {
    'Column1': [1, 2, np.nan, 4,5],
    'Column2': [np.nan, 2, 3, 4,5],
    'Column3': [1, np.nan, 3, 4,np.nan]
}

df = pd.DataFrame(data)

# Create a SimpleImputer object with the mean strategy
imputer = SimpleImputer(strategy='constant')

# Fit the imputer and transform the DataFrame
df_imputed = pd.DataFrame(imputer.fit_transform(df), columns=df.columns)


print("original DataFrame with missing values:\n",df)
print("\n DataFrame after imputation:\n",df_imputed)

original DataFrame with missing values:
    Column1  Column2  Column3
0      1.0      NaN      1.0
1      2.0      2.0      NaN
2      NaN      3.0      3.0
3      4.0      4.0      4.0
4      5.0      5.0      NaN

 DataFrame after imputation:
    Column1  Column2  Column3
0      1.0      0.0      1.0
1      2.0      2.0      0.0
2      0.0      3.0      3.0
3      4.0      4.0      4.0
4      5.0      5.0      0.0

In [40]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

# Create a DataFrame with NULL values
data = {
    'Column1': [1, 2, np.nan, 4,5],
    'Column2': [np.nan, 2, 3, 4,5],
    'Column3': [1, np.nan, 3, 4,np.nan]
}

df = pd.DataFrame(data)

# Create a SimpleImputer object with the mean strategy
imputer = SimpleImputer(strategy='most_frequent')

# Fit the imputer and transform the DataFrame
df_imputed = pd.DataFrame(imputer.fit_transform(df), columns=df.columns)


print("original DataFrame with missing values:\n",df)
print("\n DataFrame after imputation:\n",df_imputed)

original DataFrame with missing values:
    Column1  Column2  Column3
0      1.0      NaN      1.0
1      2.0      2.0      NaN
2      NaN      3.0      3.0
3      4.0      4.0      4.0
4      5.0      5.0      NaN

 DataFrame after imputation:
    Column1  Column2  Column3
0      1.0      2.0      1.0
1      2.0      2.0      1.0
2      1.0      3.0      3.0
3      4.0      4.0      4.0
4      5.0      5.0      1.0

In [48]:
import pandas as pd
data = pd.read_csv("missing values.csv")
print(data)

   Region   Age   Income Online Shopper
0   India  49.0  86400.0             No
1  Brazil  32.0  57600.0            Yes
2     USA  35.0  64800.0             No
3  Brazil  43.0  73200.0             No
4     USA  45.0      NaN            Yes
5   India  40.0  69600.0            Yes
6  Brazil   NaN  62400.0             No
7   India  53.0  94800.0            Yes
8     USA  55.0  99600.0             No
9   India  42.0  80400.0            Yes

In [54]:
from sklearn.impute import SimpleImputer
import pandas as pd

# Assuming df is already defined and loaded

# Select numeric and categorical columns
numeric_cols = df.select_dtypes(include=['number']).columns
category_cols = df.select_dtypes(exclude=['number']).columns

# Impute numeric columns with the mean strategy
imputer_numeric = SimpleImputer(strategy='mean')
df[numeric_cols] = imputer_numeric.fit_transform(df[numeric_cols])

# Impute categorical columns with the most frequent strategy
imputer_category = SimpleImputer(strategy='most_frequent')
df[category_cols] = imputer_category.fit_transform(df[category_cols])

# Display the DataFrame after imputation
print(df)

   Region        Age        Income Online Shopper
0   India  49.000000  86400.000000             No
1  Brazil  32.000000  57600.000000            Yes
2     USA  35.000000  64800.000000             No
3  Brazil  43.000000  73200.000000             No
4     USA  45.000000  76533.333333            Yes
5   India  40.000000  69600.000000            Yes
6  Brazil  43.777778  62400.000000             No
7   India  53.000000  94800.000000            Yes
8     USA  55.000000  99600.000000             No
9   India  42.000000  80400.000000            Yes

In [51]:
imputer=SimpleImputer(strategy='mean')
df[['Age,'Income']]=imputer.fit_transform

Original DataFrame with missing values:
    Region   Age   Income Online Shopper
0   India  49.0  86400.0             No
1  Brazil  32.0  57600.0            Yes
2     USA  35.0  64800.0             No
3  Brazil  43.0  73200.0             No
4     USA  45.0      NaN            Yes
5   India  40.0  69600.0            Yes
6  Brazil   NaN  62400.0             No
7   India  53.0  94800.0            Yes
8     USA  55.0  99600.0             No
9   India  42.0  80400.0            Yes

ValueError: Cannot use mean strategy with non-numeric data:
could not convert string to float: 'India'

In [55]:
import pandas as pd
data = pd.read_csv("titanic.csv")
print(data)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [ ]:
import pandas as pd
import numpy as np

data = {
    'Column1': [1, 2, np.nan, 4,5],
    'Column2': [np.nan, 2, 3, 4,5],
    'Column3': [1, np.nan, 3, 4,np.nan]
}